bruelltuete/freebsd-src/share/man/man4/it8613hwm.4
.\"
.\" SPDX-License-Identifier: BSD-2-Clause-FreeBSD
.\"
.\" Copyright (c) 2022 Johannes Totz
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd September 8, 2022
.Dt IT8613HWM 4
.Os
.Sh NAME
.Nm it8613hwm
.Nd device driver for the ITE IT8613E Super I/O hardware monitor
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device superio"
.Cd "device it8613hwm"
.Ed
.Pp
Alternatively, to load the driver as a module at boot time, place the following
line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
it8613hwm_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver supports reading the temperature sensor and fan speed from the hardware
monitor present in the IT8613E Super I/O chip.

There are 3 temperature sensor channels but not all may be connected on the
mainboard. These are reported through a sysctl node named
.Va dev.it8613hwm.0.temperature%d ,
where %d goes from 0 to 2 inclusive.

There are also 3 fan speed channels, again not all of those may be connected on
the mainboard, reported in units of RPM via
.Va dev.it8613hwm.0.fan%d .
.Sh EXAMPLES
To get the current values for all temperature sensors and fans:
.Pp
.Dl "$ sysctl dev.it8613hwm"
.Dl "dev.it8613hwm.0.fan2: 1470"
.Dl "dev.it8613hwm.0.fan1: 648"
.Dl "dev.it8613hwm.0.fan0: 0"
.Dl "dev.it8613hwm.0.temperature2: 35C"
.Dl "dev.it8613hwm.0.temperature1: 40C"
.Dl "dev.it8613hwm.0.temperature0: 49C"
.Pp
As can be seen in this example, there is no fan connected to fan0.
.Sh SEE ALSO
.Xr superio 4 ,
.Xr sysctl 8
.Sh AUTHORS
.An -nosplit
The driver and manual page was written by
.An Johannes Totz .
.Sh BUGS
No public datasheet is available for this chip. The information to write this
driver was obtained through trial-and-error and datasheets for similar (but
ultimately different) chips.
